// הוא בעצם אובייקט שאני מקבל מהספרייה הראשית של הנוד-ג'יי-אס ת שומר במשתנה הזה והוא מכיל מלא מטודות פונקציונאליות שאוכל להשתמש בהם בכל מה שקשור לקבציםfs
const fs = require('fs');

// הפעלת הפונקציות
readTextFromFileASync();
readTextFromFileSync();

// אופציה ראשונה (סינכרוני - פחות טוב)
// פחות טוב כי הוא עושה פעולה אחת כל פעם עד שמסיים אותה וממשיך להבאה בתור (ב-ג'אווה סקריפט יש רק מפעיל אחד והוא עסוק בכל פקודה עד שמסיים איתה וממשיך להבאה אחריה)
// אני מכניס את 2 השורות של הקוד לתוך פונקציה כדי שיהיה זמין לעבודות במקומות אחרים בהמשך וגם לקרוא ל-2 האפשרויות ביחד ולראות את השוני
function readTextFromFileSync() {
  const contents = fs.readFileSync('readText.txt', 'utf8');
  console.log('Im from the First Option (Sync)');
  console.log(contents);
}

// אופציה שניה (אסינכרוני - הכי טוב)
// מה קורה בתוך הפונקציה ? ( 2 השורות שבפנים) - אני אומר לו שמע לך אל הקובץ הזה שאני מתאר לך את המיקום שלו ואיך קוראים לו , תכנס אליו לתוכן שלו תקרא אותו , וכשאתה מסיים ואתה מוכן בעצם , תפעיל את הקולבאק הזה שרשמתי לך בפסיק השלישי בפרמטרים כלומר עד שהוא מסיים לעבור על כל הקובץ הוא ממשיך לפעולות שאמורות להיות בהמשך התוכנית ולהריץ אותן , ורק כאשר הוא סיים לקרוא את הקובץ והוא מוכן אז הפקודה של ההדפסה למסך את התוכן שיש במסמך תיצא לפועל בעזרת הקולבאק
// הערה לגבי הפונקציית קולבאק - הפונקציה הזו תמיד מקבלת 2 פרמטרים (והם : אירור  וטקסט ואני יכול לקרוא להם איך שבא לי השמות לא חובה הם רק פרמטרים , אבלל !! הסוג פרמטר שיש שם בכל אחד מהם תמיד יהיה מאותו הסוג הראשון הוא - כאשר אני מקבל שגיאה בפעולה שעשיתי לפני (כלומר לקרוא את הטקסט מהמסמך), ואת זה אני בודק בבדיקת איף ואם באמת קיבלתי שגיאה אז מה שבתוך האיף יופעל וזה בעצם הודעת השגיאה שלי וכל עוד יש הודעת שגיאה לעולם לא אגיע לסיום ה-איף ולשורת קוד האחרונה שהיא בעצם השורה של הפקודה עבור הפרמטר השני - שהוא בעצם התוצאה החיובית שיש אישור מהפעולה שציינתי לפני כלומר - קריאת המסמך ואז אם קיבלתי את הפרמטר השני אני בעצם מוציא לפועל את הפקודה הסופית שהיא המטרה בסוף וזה להדפיס את התוכן למסך
// הערה חשובה - הפרמטר השני של ההצלחה - (קונאנטס) אליו בעצם נכנס כל התוכן של הפעולה של הקריאת המסמך שהוגדרה לפני כן ואז מדפיסים את הקונטנסט הזה כדי לראות על המסך את התוכן של המסמך טקסט שביקשנו לקרוא
function readTextFromFileASync() {
  const contents = fs.readFile('readText.txt', 'utf8', (err, contents) => {
    console.log('Im from the Second Option (ASync)');
  console.log(contents);
  });
  console.log('Im from the Second Option (ASync) - But After The CallBack');
}